{
"Walter": {
    "name": "Walter Sande",
    "life": 15,
    "defense": 1,
    "damage": 2,
    "voice": "walter_txt.wav",
    "starter_text": "Um homem alto e descontraído se aproxima, com slides de gráficos em suas mãos. Ele começa a falar sobre algo chamado Vasco.",
    "attacks_dialogues": [
        "A vida é baseada em dois fundamentos: Vasco Futebol Clube e derivar e igualar a zero",
        "Só uma coisa me deixa mais bravo do que slides com figuras e textos desalinhados: o Vasco",
        "Fiz uma análise exploratória para uma empresa. Calculei Chi Quadrado, V de Cramer, Correlação, Covariância e R^2. Não saí do lugar",
        "Não se atreva a fazer a horrorosidade do GRÁFICO DE PIZZA. Neste curso, ele é ESTRITAMENTE PROIBIDO"
    ],
    "act": [
        {
            "label": "Checar",
            "responses": [
                "ATK - 3  DEF - 100"
            ],
            "effect": null
        },
        {
            "label": "Fazer Atividade",
            "responses": [
                "Apesar de Walter ficar feliz com a atividade feita, ele não mostra tanto interesse nisso"
            ],
            "effect": null
        },
        {
            "label": "Vasco",
            "responses": [
                "Você diz que o seu time preferido é o Vasco Futebol Clube. Walter agora te considera como amigo",
                "A defesa de Walter diminuiu!"
            ],
            "effect": "-defense"
        },
        {
            "label": "Oferecer Pizza",
            "responses": [
                "Walter, com o olhar furioso, diz que odeia tudo relacionado a pizza",
                "A defesa de Walter aumentou!",
                "O ataque de Walter aumentou!"
            ],
            "effect": [
                "+defense - COLOCAR O EFEITO NA CLASSE DOS BOSSES",
                "+attack - COLOCAR O EFEITO NA CLASSE DOS BOSSES"       
            ]  
        }
    ]
},

"Pinho": {
    "name": "Rafael Pinho",
    "life": 20,
    "defense": 2,
    "damage": 2,
    "voice": "pinho_txt.wav",
    "starter_text": "Um homem nerd se aproxima. Você o reconhece: é o pai do Python",
    "attacks_dialogues": [
        "Olá amiguinho, hoje tem teste surpresa. Como você vem na minha aula, você poderá entrar na sala",
        "Sempre agradeço as máquinas de café, apesar delas me decepcionarem a maioria das vezes",
        "Dei uma aula muito boa ontem e todos lactaram de conhecimento. Pena que depois eu acordei do meu sono",
        "Hoje à tarde irei assistir o filme 13º guerreiro. Pelas minhas contas, essa será a 13ª vez que assisto. Odeio coincidências",
        "Você não sabe fazer teste unitário, docstring, doctype e doctest? Que decepção amiguinho, parece que você não está lactando o suficiente"
    ],
    "act": [
        {
            "label": "Checar",
            "responses": [
                "ATK - 3  DEF - 100"
            ],
            "effect": null
        },
        {
            "label": "Lactar Conhecimento",
            "responses": [
                "Pinho diz que você está lactando muito conhecimento, mas não o suficiente para passar!"
            ],
            "effect": null
        },
        {
            "label": "Pergunta de Peano",
            "responses": [
                "Você pergunta sobre um assunto aleatório e Pinho te responde corretamente!"
            ],
            "effect": null
        },
        {
            "label": "Oferecer Café",
            "responses": [
                "Ele disse que ama café, mas que não aceita nada de alunos. Contudo, agradeu a gentileza!",
                "A defesa de Pinho diminuiu!"
            ],
            "effect": "-defense"
        }
    ]
},

"Branco": {
    "name": "Branco Saraiva",
    "life": 25,
    "defense": 2,
    "damage": 3,
    "voice": "branco_txt.wav",
    "starter_text": "Um senhor sorridente se aproxima, não deixe seu riso contagiante de atingir!",
    "attacks_dialogues": [
        "As vezes deixo escapar minha outra personalidade, o Preto. Mas me contenho para usar ela na hora das provas HAHAHAHAHA",
        "Você conseguiu fazer a questão 3? Pois é, eu também não HAHAHAHAHAHA",
        "Ontem montei uma lista básica e curta sobre integrais para os meus alunos fixarem o conteúdo. Tinha apenas 75 questões HAHAHAHAHAHA",
        "Não sou muito fã de calculadoras. Por isso que meus alunos não usam HAHAHAHA"
    ],
    "act": [
        {
            "label": "Checar",
            "responses": [
                "ATK - 3  DEF - 100"
            ],
            "effect": null
        },
        {
            "label": "Contar Piada",
            "responses": [
                "Você conta uma piada para Branco. Ele solta uma risadela sincera!",
                "A defesa de Branco diminuiu!"
            ],
            "effect": "-defense"
        },
        {
            "label": "Remar",
            "responses": [
                "Ele diz que sente falta de remar algumas vezes. Ele te convida para uma sessão de remo!",
                "A defesa de Branco diminuiu!"
            ],
            "effect": "-defense"
        },
        {
            "label": "Pedir Revisão",
            "responses": [
                "Você pede revisão dos conteúdos de integrais. Mas, ele olha para você e diz que não faz revisões"
            ],
            "effect": null
        }
    ]
},

"Soledad": {
    "name": "Maria Soledad",
    "life": 30,
    "defense": 3,
    "damage": 3,
    "voice": "soledad_txt.wav",
    "starter_text": " OK LEGAL A VER",
    "attacks_dialogues": [
        "OK",
        "LEGAL",
        "A VER",
        "Vamos a demostrar ese teorema obscuro por un raciocinio nunca antes visto: induccion"
    ],
    "act": [
        {
            "label": "Checar",
            "responses": [
                "ATK - 3  DEF - 100"
            ],
            "effect": null
        },
        {
            "label": "OK",
            "responses": [
                "OK",
                "A defesa de Soledad aumentou!"
            ],
            "effect": "+defense"
        },
        {
            "label": "LEGAL",
            "responses": [
                "LEGAL",
                "A defesa de Soledad aumentou!"
            ],
            "effect": "+defense"
        },
        {
            "label": "A VER",
            "responses": [
                "A VER",
                "A defesa de Soledad aumentou!"
            ],
            "effect": "+defense"
        }
    ]
},

"Yuri" : {
    "name": "Yuri Saporito",
    "life": 35,
    "defense": 4,
    "damage": 4,
    "voice": "yuri_txt.wav",
    "starter_text": "O coordenador do curso se aproxima, você sente as horas de procrastinação rastejando em suas costas",
    "attacks_dialogues": [
        "Você prefere os sistemas lineares na row picture ou na column picture? Cuidado para não responder errado e acabar reprovando",
        "Ontem me lembrei de uma aplicação da teorema espectral que vi no meu doutorado. Acho que meus alunos vão gostar, principalmente na hora da prova HAHAHAHA",
        "FAÇA ANÁLISE, FAÇA ANÁLISE, FAÇA ANÁLISE, FAÇA ANÁLISE, FAÇA ANÁLISE, FAÇA ANÁLISE, FAÇA ANÁLISE, FAÇA ANÁLISE",
        "Hoje eu cheguei no horário pela primeira vez. Ainda é meio dia. O tempo passa rápido dando aula para essa turma.",
        "Sempre que ando nos corredores da EMAp vejo alguns alunos estudando. Admiro eles, apesar de achar um desperdício de tempo se dedicar para uma matéria tão fácil",
        "LU, CR, LDU, LDL^T, QR, SVD, SΛS^-1, QΛQ^T, RR^T. Me pergunto qual delas é a favorita dos meus alunos."
    ],
    "act": [
        {
            "label": "Checar",
            "responses": [
                "ATK - 3  DEF - 100"
            ],
            "effect": null
        },
        {
            "label": "Implorar Ponto",
            "responses": [
                "Ele não parece convencido, vai ter que fazer muito mais que isso para o convencer"
            ],
            "effect": null
        },
        {
            "label": "Chorar",
            "responses": [
                "Ele olha para você com uma cara serena, seu chororô não funcionou!"
            ],
            "effect": null
        },
        {
            "label": "Tirar Dúvida",
            "responses": [
                "Você demonstrou interesse na matéria, Yuri mostra empatia por você!",
                "A defesa de Yuri diminuiu!"
            ],
            "effect": "-defense"
        }
    ]
}
}
